package by.kleban.myapplication.homework6


class CardList {

    companion object {
        fun createList(): MutableList<Card> {
            return mutableListOf(
                Card(
                    "Праздник радостный и светлый\n" +
                            "Отмечает вся страна.\n" +
                            "Пусть всем мирно солнце светит\n" +
                            "Миру не нужна война.\n" +
                            "\n" +
                            "С Днем Победы всех поздравим,\n" +
                            "Слава павшим и живым.\n" +
                            "Подвиг ваш великий славим\n" +
                            "И «спасибо» говорим.",
                    "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRb" +
                            "_0R-n_JWQk5Z_kpHfPa-RezqsuL8sMeR_Q&usqp=CAU"
                ),
                Card(
                    "9 Мая — праздник великий!\n" +
                            "Никто не забыт и ничто не забыто!\n" +
                            "Живым ветеранам — низкий поклон!\n" +
                            "А тех, что ушли — не забудем имен!\n" +
                            "\n" +
                            "Они ушли, оставив память,\n" +
                            "Оставив честь нам и свободу,\n" +
                            "Осталось красное их знамя,\n" +
                            "Перенесенное сквозь годы!\n" +
                            "\n" +
                            "Великий подвиг сохраним\n" +
                            "Мы в наших душах и сердцах\n" +
                            "И об ушедших помолчим\n" +
                            "Мы со слезами на глазах!\n",
                    "https://encrypted-tbn0.gstatic.com/images?q=tbn:" +
                            "ANd9GcS2LaAIC8q_lpHfGx0wqsr4Lg7VJHMigWNUMg&usqp=CAU"
                ),
                Card(
                    "Поздравляю с Днем Победы\n" +
                            "И желаю в этот день\n" +
                            "Море радости и света,\n" +
                            "И здоровья, как кремень!\n" +
                            "\n" +
                            "Не забыт великий праздник,\n" +
                            "Хоть прошли уже года.\n" +
                            "Желаю вам добра и счастья,\n" +
                            "Неба мирного всегда!",
                    "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS" +
                            "4LbNB9_z07_hNuIrnE7owh8fdjbSvvhej0A&usqp=CAU"
                ),
                Card(
                    "\n" +
                            "Чудесный майский день. Весна.\n" +
                            "И радость неземная —\n" +
                            "Для всех закончилась война\n" +
                            "Жестокая и злая.\n" +
                            "\n" +
                            "Незабываемый тот день\n" +
                            "Стал праздником Победы,\n" +
                            "Которую для нас для всех\n" +
                            "Отвоевали деды.\n" +
                            "\n" +
                            "За то, что мы теперь живём\n" +
                            "Под этим небом мирным,\n" +
                            "Всём, кто когда-то пал в бою,\n" +
                            "Земной поклон, спасибо!\n" +
                            "\n" +
                            "Пусть ужас страшной той войны\n" +
                            "Вовек не повторится,\n" +
                            "И жизнь, что подарили нам,\n" +
                            "Потомками хранится.",
                    "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTW" +
                            "8LWs_O_IbqxxRa7-UnKL8RoDX2soy_FGTA&usqp=CAU"
                ),
                Card(
                    "День Победы — яркий праздник —\n" +
                            "Будем помнить мы всегда.\n" +
                            "Гордость за народ российский\n" +
                            "Пронесем через века.\n" +
                            "\n" +
                            "Поздравляем всех сегодня\n" +
                            "И желаем от души,\n" +
                            "Чтобы будущее наше\n" +
                            "Не познало бы войны.\n" +
                            "\n" +
                            "Чтоб не знали люди боли,\n" +
                            "Разных горестей, потерь,\n" +
                            "Чтоб светило нашим детям\n" +
                            "Только солнце мирных дней.\n",
                    "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSjtcx" +
                            "JIYAlpnouu161W6pfeprFYpPtKr_mtA&usqp=CAU"
                ),
                Card(
                    "Великий праздник, День Победы!\n" +
                            "Пусть много лет уже прошло,\n" +
                            "Но помним подвиг наших дедов\n" +
                            "И благодарны им за то.\n" +
                            "\n" +
                            "Как жаль, что меньше с каждым годом\n" +
                            "В строю парадном их идет.\n" +
                            "Но главное, в сердцах народа\n" +
                            "Лучинка памяти живет.\n",
                    "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd" +
                            "9GcRREqyuL29jNZwJrxzZEyDT2ZrhMVQc0csmQA&usqp=CAU"
                ),
                Card(
                    "Желаю неба чистого,\n" +
                            "И мира без войны,\n" +
                            "И солнышка лучистого,\n" +
                            "Над всей землей страны.\n" +
                            "\n" +
                            "Родных, любимых — с праздником!\n" +
                            "Любви, здоровья, сил!\n" +
                            "Чтоб каждый день вас радовал\n" +
                            "И счастье приносил.",
                    "https://encrypted-tbn0.gstatic.com/images?q=tbn:" +
                            "ANd9GcRp71BwB90Gtk6QhcalerzWQQSgE0SShlp75g&usqp=CAU"
                ),
                Card(
                    "Пускай не будет в мире войн,\n" +
                            "Пусть не свистит над головой\n" +
                            "Безжалостный, глухой снаряд,\n" +
                            "Спокойным будет сон ребят.\n" +
                            "\n" +
                            "Пусть матери не знают слез\n" +
                            "За сыновей, что бой унес,\n" +
                            "Родных чтоб не теряли вы.\n" +
                            "С 9 Мая, с днем весны!",
                    "https://encrypted-tbn0.gstatic.com/images?q=tbn:A" +
                            "Nd9GcTKKIXFq9p_mEbPxZZlgR-TGh0RdscafMx7Ow&usqp=CAU"
                )
            )
        }
    }
}